# SpotDimStyleSlopeUnitsAlt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotDimStyleSlopeUnitsAlt Property
ParameterTypeId Class See Also
---
"Alternate Units Format"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotDimStyleSlopeUnitsAlt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotDimStyleSlopeUnitsAlt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotDimStyleSlopeUnitsAlt {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace